Revit 2027 API
AssetPropertyList.IsValidValue Method
 Check that value is valid.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidValue(
	IList<AssetProperty> value
)
Public Function IsValidValue (
	value As IList(Of AssetProperty)
) As Boolean
public:
bool IsValidValue(
	IList<AssetProperty^>^ value
)
member IsValidValue :
        value : IList<AssetProperty> -> bool
Parameters
value IList<AssetProperty>
 The array of properties to validate.
Return Value
Boolean
 Returns true if the array of properties is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace